**** Approaches to lookahead
- ignore characters, parse the "words" defined by python and file read (spaces, tabs, newlines)

#+BEGIN_SRC python :session

#+END_SRC

I could probably handle alnums separately as they are likely to be the longest strings needed to be processed as a unit. 
Then the comments are likely to be annoying. 

#+BEGIN_SRC c
  //this is a comment, to be annoying
  int main() {
      int i = getint(), j = getint();
      while (i != j) {
        if (i > j) i = i - j;
        else j = j - i;
      }
      putint(i);
    }
#+END_SRC

Does my current program parse this correctly?
#+BEGIN_SRC python :session
  read_file("gcd.c")
#+END_SRC

#+RESULTS:
:       if (i > j) i = i - j;

It totally does (because I'm not doing individual character matching or trying to remove the comments). So all good until i decide to actually do stuff with it then. 


#+BEGIN_SRC python :session
with open("gcd.c") as gcd:
    for line in gcd:
        for word in line:
            if not is_whitespace(word):
                print(word)
#+END_SRC

